greet = "Привет, {name}! Этот бот создан для студентов и абитуриентов МРК. Вы можете задавать любые вопросы, и мы с радостью на них ответим. Мы регулярно выкладываем много полезной информации."


rispois = (
        '<b>Разработка и сопровождение программного обеспечения информационных технологий</b>\n\n'
        '<b>Код специальности</b>\n'
        '5-04-0612-02\n\n'
        '<b>Квалификация специалиста</b>\n' 
        'техник-программист\n\n'
        '<b>Форма получения образования</b>\n'
        'дневная\n\n'
        '<b>Срок обучения</b>\n'
        'ОБО: 3 года 10 месяцев\n'
        'ОСО: 2 года 10 месяцев (дистанционное)\n\n'
        '<b>Теоретические и практические навыки по следующим направлениям</b>\n'
        '– алгоритмические и объектно-ориентированные языки программирования С,С++,С#\n'
        '– .Net технологии, инструментальные среды разработки программ, прикладные программы\n'
        '– языки программирования Python, JS, Java, а также язык гипертекстовой разметки HTML \n'
        '– современные методологии и технологии разработки программных средств\n'
        '– операционные системы Windows, Linux\n'
        '– системы распределенной обработки, Интернет-технологии\n'
        '– информационные системы и технологии, базы данных\n'
        '– графические системы и мультимедиа\n'
        '– системы автоматизированной разработки и тестирования программного обеспечения\n'
        '– банковские компьютерные системы, автоматизация деятельности банка\n'
        '– организация и функционирование компьютеров\n\n'
        '<b>Более подробно оспециальности:</b>\n'
        'https://mrk-bsuir.by/ru/explore/specialties/rispois-technician-programmer/'
)

teey = (
        '<b>Техническая эксплуатация ээлектронных устройств</b>\n\n'
        '<b>Код специальности</b>\n'
        '5-04-0713-06\n\n'
        '<b>Квалификация специалиста</b>\n' 
        'техник\n\n'
        '<b>Форма получения образования</b>\n'
        'дневная\n\n'
        '<b>Срок обучения</b>\n'
        'ОБО: 3 года 10 месяцев\n\n'
        '<b>Теоретические и практические навыки по следующим направлениям</b>\n'
        '– инженерная графика\n'
        '– теоретические основы электротехники\n'
        '– стандартизация и сертификация\n'
        '– радиотехника\n'
        '– электрические измерения и другие\n'
        '– источники питания электронных устройств\n'
        '– цифровая и микропроцессорная техника\n'
        '– электрические и электронные компоненты устройств и систем и другие\n\n'
        '<b>Более подробно оспециальности:</b>\n'
        'https://mrk-bsuir.by/ru/explore/specialties/teeu-technician/'
)

peu = (
        '<b>Производство электронных устройств</b>\n\n'
        '<b>Код специальности</b>\n'
        '5-04-0713-05\n\n'
        '<b>Квалификация специалиста</b>\n' 
        'техник-технолог\n\n'
        '<b>Форма получения образования</b>\n'
        'дневная\n\n'
        '<b>Срок обучения</b>\n'
        'ОБО: 3 года 10 месяцев\n\n'
        '<b>Теоретические и практические навыки по следующим направлениям</b>\n'
        '– инженерная графика\n'
        '– теоретические основы электротехники\n'
        '– стандартизация и сертификация\n'
        '– радиотехника\n'
        '– электрические измерения\n'
        '– аналоговая и цифровая схемотехника и другие\n'
        '– источники питания электронных устройств\n'
        '– цифровая и микропроцессорная техника\n'
        '– конструирование электронных устройств\n'
        '– технология производства электронных устройств и другие\n'
        '– электрические измерения\n\n'
        '<b>Более подробно оспециальности:</b>\n'
        'https://mrk-bsuir.by/ru/explore/specialties/pes-technologist/'
)

pmu = (
        '<b>Программирование мобильных устройств</b>\n\n'
        '<b>Код специальности</b>\n'
        '5-04-0611-01\n\n'
        '<b>Квалификация специалиста</b>\n' 
        'техник-программист\n\n'
        '<b>Форма получения образования</b>\n'
        'дневная\n\n'
        '<b>Срок обучения</b>\n'
        'ОБО: 3 года 10 месяцев\n\n'
        '<b>Теоретические и практические навыки в области</b>\n'
        '– беспроводной и проводной связи\n'
        '– компьютерного программирования, консультации и других сопутствующих услуг\n'
        '– информационного обслуживания\n'
        '– инженерная графика\n\n'
        '<b>Более подробно оспециальности:</b>\n'
        'https://mrk-bsuir.by/ru/explore/specialties/pmu-software-engineer/'
)

pimin = (
        '<b>Производство изделий микро- и наноэлектроники</b>\n\n'
        '<b>Код специальности</b>\n'
        '5-04-0713-09\n\n'
        '<b>Квалификация специалиста</b>\n' 
        'техник-технолог\n\n'
        '<b>Форма получения образования</b>\n'
        'дневная\n\n'
        '<b>Срок обучения</b>\n'
        'ОБО: 3 года 10 месяцев\n\n'
        '<b>Выпускник специальности умеет</b>\n'
        '– соблюдать требования по охране труда, безопасности и защите окружающей среды\n'
        '– исследовать свойства материалов и измерять электрические параметры\n'
        '– участвовать в разработке, испытаниях и внедрении новых технологий и оборудования\n'
        '– осуществлять выбор и анализ наноразмерных структур и материалов для электронной техники\n'
        '– использовать методы расчета и проектирования в микроэлектронике и наноэлектронике\n'
        '– применять информационные технологии и системы автоматизированного проектирования\n\n'
        '<b>Более подробно оспециальности:</b>\n'
        'https://mrk-bsuir.by/ru/explore/specialties/pmu-software-engineer/'
)

toib = (
        '<b>Техническое обеспечение информационной безопасности</b>\n\n'
        '<b>Код специальности</b>\n'
        '5-04-0611-02\n\n'
        '<b>Квалификация специалиста</b>\n' 
        'техник по информационной безопасности\n\n'
        '<b>Форма получения образования</b>\n'
        'дневная\n\n'
        '<b>Срок обучения</b>\n'
        'ОБО: 3 года 10 месяцев\n\n'
        '<b>Выпускник специальности умеет</b>\n'
        '– формировать позитивный морально-психологический климат\n'
        '– соблюдать меры безопасности\n'
        '– проводить экономические расчеты эффективности решений\n'
        '– разрабатывать и администрировать базы данных\n'
        '– настраивать и сопровождать операционные системы\n'
        '– защищать информацию с помощью криптографических методов'
        '– определять и классифицировать угрозы информационной безопасности\n'
        '– анализировать и проектировать электрические схемы\n'
        '– проводить диагностику и тестирование программных и аппаратных средств\n\n'
        '<b>Более подробно оспециальности:</b>\n'
        'https://mrk-bsuir.by/ru/explore/specialties/toib-information-security-technician/'
)

tesvt = (
        '<b>Техническая эксплуатация средств вычислительной техники</b>\n\n'
        '<b>Код специальности</b>\n'
        '5-04-0713-01\n\n'
        '<b>Квалификация специалиста</b>\n' 
        'техник-электроник\n\n'
        '<b>Форма получения образования</b>\n'
        'дневная\n\n'
        '<b>Срок обучения</b>\n'
        'ОБО: 3 года 10 месяцев\n\n'
        '<b>Выпускник специальности умеет</b>\n'
        '– применять и анализировать НПА и ТНПА, регламентирующие профессиональную деятельность\n'
        '– владеть навыками деловых коммуникаций, формировать морально-психологический климат в коллективе\n'
        '– соблюдать законодательство по охране труда, безопасности и охране окружающей среды\n'
        '– рассчитывать экономические показатели эффективности, понимать основы предпринимательской деятельности\n'
        '– использовать математические методы для решения задач, строить чертежи и схемы\n'
        '– определять угрозы информационной безопасности, соблюдать требования и проводить сертификацию'
        '– анализировать и проектировать электрические схемы, выбирать электроматериалы\n'
        '– анализировать и разрабатывать микропроцессорные системы, выполнять технические расчеты и разработку\n'
        '– применять методы алгоритмизации, использовать вычислительную технику и программное обеспечение\n'
        '– разрабатывать и администрировать базы данных\n\n'
        '<b>Более подробно оспециальности:</b>\n'
        'https://mrk-bsuir.by/ru/explore/specialties/te-svt-electronics-technician/#open-menu'
)

TRIGGER_RESPONSES = {
    'администраци': (
        '<b>Директор:</b>\n'
        'Шаталова Виктория Викторовна\n'
        'Email: shatalova@bsuir.by\n'
        'Тел.: 8 017 361-62-85\n'
        'Рабочее место: каб. 208.\n'
        'Прием граждан:\n'
        'Пн – 15.00-17.00,\n'
        'Чт – 15.00-17.00.\n\n'
        '<b>Заместитель директора по учебной работе:</b>\n'
        'Шумчик Франц Станиславович\n'
        'Email: zam_ur@mrk-bsuir.by\n'
        'Тел.: 8 017 257-17-70\n'
        'Рабочее место: каб. 208.\n'
        'Прием граждан:\n'
        'Вт – 15.00-17.00,\n'
        'Ср – 15.00-17.00.\n\n'
        '<b>Заместитель директора по учебно-методической работе:</b>\n'
        'Бельчик Марина Анатольевна\n'
        'Email: zam-umr@mrk-bsuir.by\n'
        'Тел.: 8 017 379-72-67\n'
        'Рабочее место: каб. 306б.\n'
        'Прием граждан:\n'
        'Пн – 15.00-17.00,\n'
        'Чт – 15.00-17.00.\n\n'
        '<b>Заместитель директора по воспитательной работе:</b>\n'
        'Бобко Елена Анатольевна\n'
        'Email: zam_vr@mrk-bsuir.by\n'
        'Тел.: 8 017 353-27-20\n'
        'Рабочее место: каб. 203.\n'
        'Прием граждан:\n'
        'Пн – 15.00-17.00,\n'
        'Чт – 15.00-17.00.\n\n'
        '<b>Заместитель директора по производственному обучению:</b>\n'
        'Науменко Жанна Николаевна\n'
        'Email: zam_po@mrk-bsuir.by\n'
        'Тел.: 8 017 378-17-44\n'
        'Рабочее место: каб. 209.\n'
        'Прием граждан:\n'
        'Пн – 15.00-17.00,\n'
        'Чт – 15.00-17.00.\n\n'
        '<b>Заместитель директора по административно-хозяйственной работе:</b>\n'
        'Чупринский Андрей Александрович\n'
        'Email: zam_directora_ahr@mrk-bsuir.by\n'
        'Тел.: 8 017 241-11-93\n'
        'Рабочее место: каб. 113.\n'
    ),
    'библиотек': (
        'Библиотека располагается в кабинетах <b>211</b> (читальный зал) и <b>212</b> (компьютерный зал).\n\n'
        '<b>График работы:</b>\n'
        'Понедельник - пятница: 8.30 - 19.00\n'
        'Суббота: 8.30 - 15.00\n'
        'Воскресенье: выходной день\n'
    ),
    'бюдже': (
    'До <b>31.08.2024</b> года всем учащимся, зачисленным на дневную бюджетную форму обучения,\n'
    '<b>для получения стипендии необходимо открыть БАЗОВЫЙ счет в ОАО АСБ «Беларусбанк»</b>\n'
    'Для открытия картсчета учащемуему (учащейся) при себе обязательно иметь паспорт. '
    'Экземпляр договора, выданный в банке на открытие карт-счета, принести в финансово-экономический отдел колледжа (кабинет 317) не позднее 02.09.2024 года.'
    ),
    'групп': (
        '📋 Список групп зачисленных абитуриентов будет доступен позднее. 😊\n'
        'Мы обязательно сообщим вам, как только информация станет доступной. Благодарим за ваше терпение!'
    ),
    'иностран': (
        '🌍 <b>Информация для иностранных граждан</b>\n\n'
        'Всю необходимую информацию о поступлении для иностранных граждан можно найти на нашем сайте. Пожалуйста, перейдите по следующим ссылкам:\n\n'
        '1. <b><a href="https://mrk-bsuir.by/ru/explore/search/21/#document-15">Памятка</a></b>: Важная информация и советы для иностранных абитуриентов.\n'
        '2. <b><a href="https://mrk-bsuir.by/ru/explore/search/19/">Нормативные документы</a></b>: Официальные документы и правила.\n'
        '3. <b><a href="https://mrk-bsuir.by/ru/explore/view/general-information-for-foreign-applicants/">Общая информация</a></b>: Общие сведения о поступлении и требования.\n\n'
        'Если у вас есть дополнительные вопросы, не стесняйтесь обращаться к нам!\n'
    ),
    'кабинет': (
        '📅 <b>Посмотреть кабинет можно в расписании</b>: <a href="https://t.me/MRC_ScheduleBot">Кликните здесь, чтобы перейти</a>.\n'
        'Вы сможете найти актуальную информацию о занятиях и свободных кабинетах. 🏫\n\n'
        'Если у вас возникнут вопросы или нужна помощь, не стесняйтесь обращаться к нам! 😊'
    ),
    'конкур': '\n',
    'канцеляри': '',
    'курс': '',
    'курсов': '',
    'материал': '',
    'медкомисси': '',
    'общежити': (
        '<b>Общежитие</b>\n'
        'Адрес: 220113, г. Минск, ул. Ломоносова, 5\n'
        'Телефон: 8 (017) 373-48-12 – вахта, воспитатели.\n'
        'С 01.01.2023 для учащихся – 11,10 руб. в месяц.\n\n'
        '<b>Документы</b>\n'
        '<a href="https://mrk-bsuir.by/ru/college-structure/others/dormitory/">Узнать перечень документов и подробную информаию</a>\n'
    ),
    'общаг': (
        '<b>Общежитие</b>\n'
        'Адрес: 220113, г. Минск, ул. Ломоносова, 5\n'
        'Телефон: 8 (017) 373-48-12 – вахта, воспитатели.\n'
        'С 01.01.2023 для учащихся – 11,10 руб. в месяц.\n\n'
        '<b>Документы</b>\n'
        '<a href="https://mrk-bsuir.by/ru/college-structure/others/dormitory/">Узнать перечень документов и подробную информаию</a>\n'
    ),
    'препод': '',
    'проект': '',
    'расписани': '📅 За расписанием можно следить <a href="https://t.me/MRC_ScheduleBot">здесь</a>\n',
    'спорт': '',
    'стипенди': '',
    'столов': '',
    'студент': '',
    'учёб': '',
}

remotely = (
    'Для учащихся, зачисленных на <b>дистанционную форму</b> получения образования, первое организационное собрание состоится <b>02.09.2024</b> в колледже (начало в 18.00, ауд. 120). Для тех, у кого нет возможности присутствовать очно, на сайте колледжа будет размещена ссылка на подключение в режиме онлайн.'
)

lists_of_enrolled = (
    '<b>Зачисление абитуриентов</b>\n\n'
    'Зачисление на основе <b>общего базового образования</b> за счет средств бюджета на дневную форму получения образования.\n'
    '<a href="https://mrk-bsuir.by/mediafiles/posts/files/prikaz-o-zachislenie-9-klass-dnevnoe-biudzhet-2b6979c0-bc44-4c03-bae8-5253f8dedce1.pdf">Посмотреть результаты</a>\n\n'
    'Зачисление на основе <b>общего среднего образования</b> за счет средств бюджета на дистанционную форму получения образования.\n'
    '<a href="https://mrk-bsuir.by/mediafiles/posts/files/prikaz-o-zachislenie-11-klass-distantsionnoe-biudz-57d1939f-5c02-40ed-b771-11a003e1c9e9.pdf">Посмотреть результаты</a>\n\n'
    'Зачисление на основе <b>общего базового образования</b> на дневную форму получения образования (платная основа).\n'
    '<a href="https://mrk-bsuir.by/mediafiles/posts/files/spiski-zachislennykh-platn-9-kl-11-kl-dist-15-08-2-9b96e324-dae4-4ad9-ae5b-d473115f55ba.pdf">Посмотреть результаты</a>\n\n'
    'Зачисление на основе <b>общего среднего образования</b> на дистанционную форму получения образования (платная основа).\n'
    '<a href="https://mrk-bsuir.by/mediafiles/posts/files/spiski-zachislennykh-platn-9-kl-11-kl-dist-15-08-2-9b96e324-dae4-4ad9-ae5b-d473115f55ba.pdf">Посмотреть результаты</a>\n\n'
)
budget_information = (
    '<b>Информация для зачисленных абитуриентов</b>\n\n'
    'До 31.08.2024 года всем учащимся, зачисленным на дневную бюджетную форму обучения, для получения стипендии необходимо '
    '<b>открыть БАЗОВЫЙ счет в ОАО АСБ «Беларусбанк»</b>. \n'
    'Для открытия картсчета учащемуся (учащейся) при себе обязательно иметь паспорт. Экземпляр договора, выданный в банке на открытие карт-счета, принести в финансово-экономический отдел колледжа (кабинет 317) не позднее 02.09.2024 года.\n\n'
    'Учащимся, зачисленным на <b>дневную форму</b> получения образования (на основе 9 классов, бюджетная и платная формы), необходимо явиться в колледж '
    '<b>30.08.2024 к 12:00</b> на первое организационное собрание. Списки групп и номера аудиторий будут размещены на стенде входной части колледжа.\n\n'
    '<b>По прибытии в колледж необходимо куратору учебной группы предоставить:</b>\n\n'
    '1. характеристику из учреждения образования, которое Вы закончили;\n'
    '2. выписку из амбулаторной карты, сведения о прививочном статусе, данные флюорографии (с 17 лет).\n\n')
information_paid = (
    'Учащимся, зачисленным на <b>дневную форму</b> получения образования (на основе 9 классов, бюджетная и платная формы), необходимо явиться в колледж '
    '<b>30.08.2024 к 12:00</b> на первое организационное собрание. Списки групп и номера аудиторий будут размещены на стенде входной части колледжа.\n\n'
    '<b>По прибытии в колледж необходимо куратору учебной группы предоставить:</b>\n\n'
    '1. характеристику из учреждения образования, которое Вы закончили;\n'
    '2. выписку из амбулаторной карты, сведения о прививочном статусе, данные флюорографии (с 17 лет).\n\n'
    'Оформление оплаты: филиал БГУИР Минский радиотехнический колледж.\n'
    'Реквизиты для оплаты за обучение: р/с BY29АКВВ36329967100165500000 ОАО "АСБ'
    'Беларусбанк", БИК – АКВВВY2Х, г. Минск, пр. Дзержинского, 18. УНП 102384171. ОКПО'
    '020718895008.\n\n'
    'Оплата производится в сроки по 31 августа 2024. Первый платёж составляет в соответствии с договором. Ваш номер договора является номером в ЕРИП.\n\n'
    '<i>Для оплаты в ЕРИП за обучение на сайте колледжа будут размещены списки зачисленных, номера договоров и сумма первого платежа!</i>'
)
tuition_fees = (
    '<b>Оплата обучения</b>\n\n'
    'Расходы республиканского бюджета на подготовку специалиста со средним специальным образованием в 2023 году составляют:\n\n'
    '– в дневной форме получения образования – 7 645,20 руб.;\n'
    '– в заочной форме получения образования – 3 119,46 руб.\n\n'
    'Указанные расходы являются оценкой на дату проведения плановых расчетов и носят справочный характер.'
    'В случае возникновения необходимости возмещения в республиканский бюджет средств, затраченных государством на подготовку специалиста, расчет производится на основании фактических расходов.\n\n'
    '✔️ <a href="https://mrk-bsuir.by/mediafiles/posts/files/stoimost-obucheniia-4b24ccb5-d108-4751-971c-dae819423344.pdf">Стоимость обучения с 01.09.2024</a>\n'
    '✔️ <a href="https://mrk-bsuir.by/mediafiles/posts/files/ecac16a6-9c56-4df2-876e-121bb81c5cb2-601af3ff-a71f-4e1c-872f-d8dd8faa92da.pdf">Оплата через дерево ЕРИП</a>\n'
    '✔️ <a href="https://mrk-bsuir.by/mediafiles/posts/files/775d90ca-d055-4d01-be88-79a16366791d-d87bcaa9-251b-43f4-bcdb-8b2aca83e2b9.pdf">Реквизиты для оплаты услуг</a>\n'
)

issuance_of_documents = (
    '<b>Выдача документов</b>\n\n'
    'Выдача документов абитуриентам, не прошедшим по конкурсу, осуществляется в каб. 204 (тел. 8 017 379-01-62).\n\n'
    'Режим работы: Пн-Чт: 8.30 – 13.00, 13.45 – 17.30; Пт: 8.30 – 13.00, 13.30 – 16.00.\n\n'
    '<b>При себе иметь:</b>\n\n'
    '1. расписку о приеме документов;\n'
    '2. паспорт.\n'
)
